app/views/cat_rental_requests/new.html.erb

SELECT "cats".* FROM "cats"
---
        <option disabled selected> -- Choose the name of the cat -- </option>
        <% Cat.all.each do |cat| %>