app/controllers/cat_rental_requests_controller.rb

INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 5], ["start_date", "2020-05-10"], ["end_date", "2020-05-20"], ["created_at", "2021-11-18 09:16:05.466266"], ["updated_at", "2021-11-18 09:16:05.466266"]]
---
    def create
        @cat_rental_request = CatRentalRequest.new(safe_params)
        if @cat_rental_request.save

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1  [["id", 2]]
---
    def current_cat_rental_request
        @cat_rental_request ||=
          CatRentalRequest.includes(:cat).find(params[:id])