app/models/cat_rental_request.rb

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2021-11-18 09:15:22.225987"], ["id", 2]]
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" != $1 AND "cat_rental_requests"."cat_id" = $2 AND NOT (start_date > '2021-09-12' OR end_date < '2021-08-12') AND (status = 'PENDING')  [["id", 2], ["cat_id", 2]]
---
    def approve!
        raise "The request is not pending" unless self.status == 'PENDING'
        transaction do
            self.status = 'APPROVED'
            self.save!
            overlapping_pending_requests.each do |req|

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2021-11-18 09:15:32.358326"], ["id", 3]]
---
    def deny!
        self.status = 'DENIED'
        self.save!

SELECT 1 AS one FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" != $1 AND "cat_rental_requests"."cat_id" = $2 AND NOT (start_date > '2021-09-12' OR end_date < '2021-08-12') AND (status = 'APROVED') LIMIT $3  [["id", 2], ["cat_id", 2], ["LIMIT", 1]]
---
    def does_not_overlap_approved_request
        unless overlapping_approved_requests.empty?